-- 插入用户
INSERT INTO `user` VALUES (1, 'admin', '管理员', '654321', 1, 1, '12345678910', 'byfanx@163.com', '郑州市', '1+1=？', '2', 1, '2022-04-07 13:09:14', '2022-04-07 13:09:14');
INSERT INTO `user` VALUES (2, 'zhangsan', '路人甲', '123456', 2, 1, '12345678910', '111111@163.com', '郑州市', '1+1=？', '2', 0, '2022-04-07 14:55:03', '2022-04-07 14:55:03');
INSERT INTO `user` VALUES (3, 'lisi', '路人乙', '123456', 2, 2, '12345678910', '222222@163.com', '郑州市', '1+1=？', '2', 0, '2022-04-07 14:55:04', '2022-04-07 14:55:03');
INSERT INTO `user` VALUES (4, 'wanger', '路人丙', '123456', 2, 1, '12345678910', '333333@163.com', '郑州市', '1+1=？', '2', 0, '2022-04-07 14:55:05', '2022-04-07 14:55:03');
INSERT INTO `user` VALUES (5, 'mazi', '路人丁', '123456', 2, 2, '12345678910', '333333@163.com', '郑州市', '1+1=？', '2', 0, '2022-04-07 14:55:06', '2022-04-07 14:55:03');
INSERT INTO `user` VALUES (6, 'zhaowu', '路人戊', '123456', 2, 1, '12345678910', '444444@163.com', '郑州市', '1+1=？', '2', 0, '2022-04-07 14:55:07', '2022-04-07 14:55:03');
INSERT INTO `user` VALUES (7, 'liliu', '路人己', '123456', 2, 2, '12345678910', '555555@163.com', '郑州市', '1+1=？', '2', 0, '2022-04-07 14:55:08', '2022-04-07 14:55:03');
INSERT INTO `user` VALUES (8, 'qianyi', '路人庚', '123456', 2, 1, '12345678910', '666666@163.com', '郑州市', '1+1=？', '2', 0, '2022-04-07 14:55:09', '2022-04-07 14:55:03');
INSERT INTO `user` VALUES (9, 'yangqi', '路人辛', '123456', 2, 2, '12345678910', '777777@163.com', '郑州市', '1+1=？', '2', 0, '2022-04-07 14:55:10', '2022-04-07 14:55:03');
INSERT INTO `user` VALUES (10, 'xuba', '路人壬', '123456', 2, 1, '12345678910', '888888@163.com', '郑州市', '1+1=？', '2', 0, '2022-04-07 14:55:11', '2022-04-07 14:55:03');
INSERT INTO `user` VALUES (11, 'hejiu', '路人癸', '123456', 2, 2, '12345678910', '999999@163.com', '郑州市', '1+1=？', '2', 0, '2022-04-07 14:55:12', '2022-04-07 14:55:03');
INSERT INTO `user` VALUES (12, 'fushi', '富十', '123456', 2, 2, '12345678910', '101010@163.com', '郑州市', '1+1=？', '2', 0, '2022-04-07 14:55:13', '2022-04-07 14:55:03');

-- 插入学校
INSERT INTO `school` VALUES (1, 2, '坡栏布刊学校', '很穷很穷', '郑州市', '张三', '123456@163.com', '1234567890', '我是一个很贫困的学校', 'images/bayMax.jpg,images/暂无图片.png', 1, 0, 1, '2022-04-07 14:57:02');
INSERT INTO `school` VALUES (2, 3, '第二小学', '很穷很穷', '郑州市', '李四', '123456@163.com', '1234567890', '我是一个很贫困的学校', 'images/bayMax.jpg,images/暂无图片.png', 1, 0, 1, '2022-04-07 14:57:02');
INSERT INTO `school` VALUES (3, 4, '第三小学', '很穷很穷', '郑州市', '王二', '123456@163.com', '1234567890', '我是一个很贫困的学校', 'images/bayMax.jpg,images/暂无图片.png', 1, 0, 1, '2022-04-07 14:57:02');
INSERT INTO `school` VALUES (4, 5, '第四小学', '很穷很穷', '郑州市', '麻子', '123456@163.com', '1234567890', '我是一个很贫困的学校', 'images/bayMax.jpg,images/暂无图片.png', 1, 0, 1, '2022-04-07 14:57:02');
INSERT INTO `school` VALUES (5, 6, '第五小学', '很穷很穷', '郑州市', '赵五', '123456@163.com', '1234567890', '我是一个很贫困的学校', 'images/bayMax.jpg,images/暂无图片.png', 1, 0, 1, '2022-04-07 14:57:02');


-- 插入招聘
INSERT INTO `recruit` VALUES (1, 1, 2, '招聘语文老师', '老师', '5K-10K', '找一个非常Nice的老师', '张三', '1234567890', '123456@163.com', 1, 0, 1, '2022-04-07 14:57:02');
INSERT INTO `recruit` VALUES (2, 2, 2, '招聘数学老师', '老师', '5K-10K', '找一个非常Nice的老师', '李四', '1234567890', '123456@163.com', 1, 0, 1, '2022-04-07 14:57:03');
INSERT INTO `recruit` VALUES (3, 3, 2, '招聘英语老师', '老师', '5K-10K', '找一个非常Nice的老师', '王二', '1234567890', '123456@163.com', 1, 0, 1, '2022-04-07 14:57:04');
INSERT INTO `recruit` VALUES (4, 4, 2, '招聘历史老师', '老师', '5K-10K', '找一个非常Nice的老师', '麻子', '1234567890', '123456@163.com', 1, 0, 1, '2022-04-07 14:57:05');
INSERT INTO `recruit` VALUES (5, 5, 2, '招聘物理老师', '老师', '5K-10K', '找一个非常Nice的老师', '赵五', '1234567890', '123456@163.com', 1, 0, 1, '2022-04-07 14:57:06');
INSERT INTO `recruit` VALUES (6, 1, 1, '招聘管理员', '管理员', '5K-10K', '找一个非常不错的管理员', '管理员', '1234567890', '123456@163.com', 1, 0, 1, '2022-04-07 14:57:07');
INSERT INTO `recruit` VALUES (7, 1, 1, '招聘运营', '运营', '5K-10K', '找一个非常不错的运营', '管理员', '1234567890', '123456@163.com', 1, 0, 1, '2022-04-07 14:57:08');
INSERT INTO `recruit` VALUES (8, 1, 1, '招聘产品', '产品', '5K-10K', '找一个非常不错的产品', '管理员', '1234567890', '123456@163.com', 1, 0, 1, '2022-04-07 14:57:09');

-- 插入学生
INSERT INTO `students` VALUES (1, 7, '李六', 2, '1234567890', '555555@163.com', '郑州市', '家徒四壁', 'images/bayMax.jpg,images/暂无图片.png', 1, 0, 1, '2022-04-07 14:57:02');
INSERT INTO `students` VALUES (2, 8, '钱一', 1, '1234567890', '666666@163.com', '郑州市', '家徒四壁', 'images/bayMax.jpg,images/暂无图片.png', 1, 0, 1, '2022-04-07 14:57:03');
INSERT INTO `students` VALUES (3, 9, '杨七', 2, '1234567890', '777777@163.com', '郑州市', '家徒四壁', 'images/bayMax.jpg,images/暂无图片.png', 1, 0, 1, '2022-04-07 14:57:04');
INSERT INTO `students` VALUES (4, 10, '徐八', 1, '1234567890', '888888@163.com', '郑州市', '家徒四壁', 'images/bayMax.jpg,images/暂无图片.png', 1, 0, 1, '2022-04-07 14:57:05');
INSERT INTO `students` VALUES (5, 11, '何九', 2, '1234567890', '999999@163.com', '郑州市', '家徒四壁', 'images/bayMax.jpg,images/暂无图片.png', 1, 0, 1, '2022-04-07 14:57:06');


-- 插入公告
INSERT INTO `notice` VALUES (1, 1, '第一条公告', '这是本系统的第一条公告！', 1, '2022-04-07 14:57:02');
INSERT INTO `notice` VALUES (2, 1, '第二条公告', '这是本系统的第二条公告！', 1, '2022-04-07 14:57:03');
INSERT INTO `notice` VALUES (3, 1, '第三条公告', '这是本系统的第三条公告！', 1, '2022-04-07 14:57:04');
INSERT INTO `notice` VALUES (4, 1, '第四条公告', '这是本系统的第四条公告！', 1, '2022-04-07 14:57:05');
INSERT INTO `notice` VALUES (5, 1, '第五条公告', '这是本系统的第五条公告！', 1, '2022-04-07 14:57:06');

-- 插入关注
INSERT INTO `attention` VALUES (1, 12, 1, 4, 0, '2022-04-07 14:57:06');
INSERT INTO `attention` VALUES (2, 12, 2, 4, 0, '2022-04-07 14:57:07');
INSERT INTO `attention` VALUES (3, 12, 3, 4, 0, '2022-04-07 14:57:08');
INSERT INTO `attention` VALUES (4, 12, 1, 5, 0, '2022-04-07 14:57:09');
INSERT INTO `attention` VALUES (5, 12, 2, 5, 0, '2022-04-07 14:57:05');
INSERT INTO `attention` VALUES (6, 12, 3, 5, 0, '2022-04-07 14:57:04');

-- 插入捐款
INSERT INTO `contribution` VALUES (1, 12, 1, 4, 100.1, '我来做慈善', 1, 0, 0, '2022-04-07 14:57:05');
INSERT INTO `contribution` VALUES (2, 12, 2, 4, 100.2, '我来做慈善', 1, 0, 0, '2022-04-07 14:57:06');
INSERT INTO `contribution` VALUES (3, 12, 3, 4, 100.3, '我来做慈善', 1, 0, 0, '2022-04-07 14:57:07');
INSERT INTO `contribution` VALUES (4, 12, 1, 5, 100.4, '我来做慈善', 1, 0, 0, '2022-04-07 14:57:08');
INSERT INTO `contribution` VALUES (5, 12, 2, 5, 100.5, '我来做慈善', 1, 0, 0, '2022-04-07 14:57:09');
INSERT INTO `contribution` VALUES (6, 12, 3, 5, 100.6, '我来做慈善', 1, 0, 0, '2022-04-07 14:57:10');
INSERT INTO `contribution` VALUES (7, 12, 1, 3, 100.7, '我来做慈善', 1, 0, 0, '2022-04-07 14:57:11');
INSERT INTO `contribution` VALUES (8, 12, 1, 3, 100.8, '我来做慈善', 1, 0, 0, '2022-04-07 14:57:01');
INSERT INTO `contribution` VALUES (9, 12, 1, 3, 100.9, '我来做慈善', 1, 0, 0, '2022-04-07 14:57:02');

